app/controllers/authentication_controller.rb

SELECT `authentications`.* FROM `authentications` WHERE `authentications`.`provider` = 'facebook' AND `authentications`.`uid` = '663869841' LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
INSERT INTO `authentications` (`created_at`, `provider`, `token`, `uid`, `updated_at`, `user_id`) VALUES ('2012-11-14 09:15:19', 'facebook', 'AAADjD8dXNZBYBALJP8RZB7T4rS6BRfm8BPh7Nu4PcZCXr5d6c6IXlIkJAujpygjCVQ4zm1IW54mGa8nzf8gy4iXwaPYnosZD', '663869841', '2012-11-14 09:15:19', 1)
INSERT INTO `users` (`created_at`, `current_sign_in_at`, `current_sign_in_ip`, `email`, `encrypted_password`, `last_sign_in_at`, `last_sign_in_ip`, `remember_created_at`, `reset_password_sent_at`, `reset_password_token`, `sign_in_count`, `updated_at`) VALUES ('2012-11-14 09:15:19', NULL, NULL, 'rahulindia25@gmail.com', '', NULL, NULL, NULL, NULL, NULL, 0, '2012-11-14 09:15:19')
---
 def create

  omniauth = request.env["omniauth.auth"]

  authentication = Authentication.find_by_provider_and_uid(omniauth['provider'], omniauth['uid'])

  if authentication && authentication.user.present?
  puts "come start"
  @rest = Koala::Facebook::API.new(omniauth['credentials']['token'])

  @me= @rest.get_object("me")


   session[:fbprofile] ||= [] << @me
   session[:resttoken] ||= [] << omniauth['credentials']['token']


   flash[:notice] = "Signed in successfully."


   sign_in(:user, authentication.user)

   redirect_to dashboard_url


  elsif current_user
    puts "come current"
    current_user.authentication.create!(:provider => omniauth['provider'], :uid => omniauth['uid'])

UPDATE `users` SET `last_sign_in_at` = '2012-11-14 09:15:19', `current_sign_in_at` = '2012-11-14 09:15:19', `last_sign_in_ip` = '127.0.0.1', `current_sign_in_ip` = '127.0.0.1', `sign_in_count` = 1, `updated_at` = '2012-11-14 09:15:19' WHERE `users`.`id` = 1
---
    user = User.new
    user.apply_omniauth(omniauth)

    if user.save