app/controllers/twitter_controller.rb

  def callback
   @oauth_consumer ||= OAuth::Consumer.new('fVGrZmGe99AuKwE4HMLC1A', 'T3zyjeQzujkC3k2IVyvTdqnt4eK4ZcA3y5Tr2RTc', :site => 'http://api.twitter.com', :request_endpoint => 'http://api.twitter.com', :sign_in => true)
    request_token = OAuth::RequestToken.new(@oauth_consumer, session['request_token'], session['request_secret'])
    access_token = request_token.get_access_token(:oauth_verifier => params[:oauth_verifier])
    #session['tw_token'] = access_token
    session['access_token'] = access_token.token
    session['access_secret'] = access_token.secret
    user = client.verify_credentials
    puts user.inspect
    session[:twprofile] ||= [] << user

    authentication = Authentication.find_by_provider_and_uid('twitter', user['id'].to_s)

  if authentication && authentication.user.present?
---
SELECT `authentications`.* FROM `authentications` WHERE `authentications`.`provider` = 'twitter' AND `authentications`.`uid` = '8669292' LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 11 LIMIT 1